posts/emacs-on-catalina.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>emacs on catalina</title>
<meta name="author" content="josiah" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/my-dark.css"/>

        <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/tooltipster.bundle.min.css"/>
        
        <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/plugins/tooltipster/sideTip/themes/tooltipster-sideTip-punk.min.css" />
        
        
        
        
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="../index.html">home</a>
<a href="../posts/articles.html">essays</a>
<a href="../personal/articles.html">diary</a>
<a href="../projects.html">projects</a>
<a href="../resume.pdf">resume</a>
<a href="../lore.html">lore</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">emacs on catalina</h1>
</header>
<div id="outline-container-orgc448022" class="outline-2">
<h2 id="orgc448022">early days</h2>
<div class="outline-text-2" id="text-orgc448022">
<p>
i had to move from mojave to catalina during the beta to test some security tooling for work (spoilers: it sucked, though now cylance has actually fixed their catalina problems) and the process was r o u g h almost entirely because of emacs.
</p>

<p>
at first there was only a single reddit post detailing what emacs users might need to know about. it linked to <a href="https://gist.github.com/dive/f64c645a9086afce8e5dd2590071dbf9">this gist</a>.
</p>

<p>
this basically says to run this lisp to add your proper emacs path to the proper exclusions and then you won't have any problems. Ok great! but that didn't work. I could now <i>launch</i> emacs from Spotlight and navigate around my Docs/Downloads/whatever, but i was totally unable to <i>swap</i> to emacs from Spotlight. this also impacted using hammerspoon as a launcher, i'm guessing because the primative behind both mechanisms is the same.
</p>
</div>
</div>

<div id="outline-container-orgc4d5107" class="outline-2">
<h2 id="orgc4d5107">partial fix</h2>
<div class="outline-text-2" id="text-orgc4d5107">
<p>
later that week, a few other people said you needed to whitelist <span class="underline">ruby's</span> executable because that was actually how homebrew installed emacs; the emacs executable is called from a ruby script (which is called by a ball rolling down a train track headed towards a toothpick which,) and thus needs to be whitelisted as well. but that didn't work either (though they were actually correct that ruby was involved).
</p>

<p>
since I could at least launch and navigate around with my then-current janky set up i stopped spending Paid Time on it and moved on. i ran the the rest of the catalina beta out and then reported back on my experience with our security tools, whatever. a few weeks ago i finally got mad enough at the situation to spend some more time looking at this and found the answer really soon! apparently a bunch of people had similar problems to me and so there are several blogs about the problem now! the one I found most helpful was <a href="https://spin.atomicobject.com/2019/12/12/fixing-emacs-macos-catalina/">this guy</a>.
</p>
</div>
</div>

<div id="outline-container-orgec0c011" class="outline-2">
<h2 id="orgec0c011">jankiest fix</h2>
<div class="outline-text-2" id="text-orgec0c011">
<p>
he gives a good breakdown as to why this is needed <span class="underline">instead of</span> the ruby application whitelisting. here's the quick fix:
</p>

<div class="org-src-container">
<pre class="src src-shell">% cd  /Applications /Emacs.app /Contents /MacOS
% mv Emacs Emacs-launcher
% mv Emacs-x86_64- 10_14 Emacs
% cd  /Applications /Emacs.app /Contents /
% rm  -rf _CodeSignature
</pre>
</div>


<p>
this is not like, super great. its makes your configuration brittle and it will break when you update emacs! version 27 is looming i hear. but at least i can fucking swap to emacs again.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator">Made with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</p></p>
</div>
</body>
</html>